In [4]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('employees.csv')

In [5]:
df

     EmployeeID          Name  Department  Age  Salary
0             1    Employee_1   Marketing   23   91087
1             2    Employee_2       Sales   53   98840
2             3    Employee_3          IT   44   84384
3             4    Employee_4       Sales   43   81005
4             5    Employee_5       Sales   46   76576
..          ...           ...         ...  ...     ...
195         196  Employee_196          IT   31  106429
196         197  Employee_197     Finance   47  117922
197         198  Employee_198   Marketing   40   85766
198         199  Employee_199          IT   24   43403
199         200  Employee_200  Operations   34   62097

[200 rows x 5 columns]

In [6]:
missing_values= df.isnull().sum()

In [12]:
missing_values

EmployeeID    0
Name          0
Department    0
Age           0
Salary        0
dtype: int64

In [47]:
df.head()
df.tail()

     EmployeeID          Name  Department  Age  Salary
195         196  Employee_196          IT   31  106429
196         197  Employee_197     Finance   47  117922
197         198  Employee_198   Marketing   40   85766
198         199  Employee_199          IT   24   43403
199         200  Employee_200  Operations   34   62097

In [13]:
high_salary = df[df['Salary']>80000]

In [14]:
print(high_salary)

     EmployeeID          Name  Department  Age  Salary
0             1    Employee_1   Marketing   23   91087
1             2    Employee_2       Sales   53   98840
2             3    Employee_3          IT   44   84384
3             4    Employee_4       Sales   43   81005
6             7    Employee_7          IT   43   92003
..          ...           ...         ...  ...     ...
192         193  Employee_193  Operations   52  107575
194         195  Employee_195          HR   48  100031
195         196  Employee_196          IT   31  106429
196         197  Employee_197     Finance   47  117922
197         198  Employee_198   Marketing   40   85766

[87 rows x 5 columns]

In [15]:
display(high_salary.head())

   EmployeeID        Name Department  Age  Salary
0           1  Employee_1  Marketing   23   91087
1           2  Employee_2      Sales   53   98840
2           3  Employee_3         IT   44   84384
3           4  Employee_4      Sales   43   81005
6           7  Employee_7         IT   43   92003

In [20]:
df.sort_index(axis=1,ascending=False)

     Salary          Name  EmployeeID  Department  Age
0     91087    Employee_1           1   Marketing   23
1     98840    Employee_2           2       Sales   53
2     84384    Employee_3           3          IT   44
3     81005    Employee_4           4       Sales   43
4     76576    Employee_5           5       Sales   46
..      ...           ...         ...         ...  ...
195  106429  Employee_196         196          IT   31
196  117922  Employee_197         197     Finance   47
197   85766  Employee_198         198   Marketing   40
198   43403  Employee_199         199          IT   24
199   62097  Employee_200         200  Operations   34

[200 rows x 5 columns]

In [22]:
type(df['Salary'])

pandas.core.series.Series

In [23]:
df['Salary']

0       91087
1       98840
2       84384
3       81005
4       76576
        ...
195    106429
196    117922
197     85766
198     43403
199     62097
Name: Salary, Length: 200, dtype: int64

In [48]:
df['Age']

0      23
1      53
2      44
3      43
4      46
       ..
195    31
196    47
197    40
198    24
199    34
Name: Age, Length: 200, dtype: int64

In [49]:
laddo = df.copy()

In [41]:
laddo

     EmployeeID          Name  Department  Age  Salary
0             1    Employee_1   Marketing   23   91087
1             2    Employee_2       Sales   53   98840
2             3    Employee_3          IT   44   84384
3             4    Employee_4       Sales   43   81005
4             5    Employee_5       Sales   46   76576
..          ...           ...         ...  ...     ...
195         196  Employee_196          IT   31  106429
196         197  Employee_197     Finance   47  117922
197         198  Employee_198   Marketing   40   85766
198         199  Employee_199          IT   24   43403
199         200  Employee_200  Operations   34   62097

[200 rows x 5 columns]

In [51]:
laddo.sort_index(axis=0,ascending=False)

     EmployeeID          Name  Department  Age  Salary
199         200  Employee_200  Operations   34   62097
198         199  Employee_199          IT   24   43403
197         198  Employee_198   Marketing   40   85766
196         197  Employee_197     Finance   47  117922
195         196  Employee_196          IT   31  106429
..          ...           ...         ...  ...     ...
4             5    Employee_5       Sales   46   76576
3             4    Employee_4       Sales   43   81005
2             3    Employee_3          IT   44   84384
1             2    Employee_2       Sales   53   98840
0             1    Employee_1   Marketing   23   91087

[200 rows x 5 columns]

In [52]:
laddo.loc[(laddo['Age']>20)]

     EmployeeID          Name  Department  Age  Salary
0             1    Employee_1   Marketing   23   91087
1             2    Employee_2       Sales   53   98840
2             3    Employee_3          IT   44   84384
3             4    Employee_4       Sales   43   81005
4             5    Employee_5       Sales   46   76576
..          ...           ...         ...  ...     ...
195         196  Employee_196          IT   31  106429
196         197  Employee_197     Finance   47  117922
197         198  Employee_198   Marketing   40   85766
198         199  Employee_199          IT   24   43403
199         200  Employee_200  Operations   34   62097

[200 rows x 5 columns]

In [55]:
high = df[df['Age']>20 & df['Salary']>90000]
high

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [60]:
df = laddo.copy()

In [61]:
df

     EmployeeID          Name  Department  Age  Salary
0             1    Employee_1   Marketing   23   91087
1             2    Employee_2       Sales   53   98840
2             3    Employee_3          IT   44   84384
3             4    Employee_4       Sales   43   81005
4             5    Employee_5       Sales   46   76576
..          ...           ...         ...  ...     ...
195         196  Employee_196          IT   31  106429
196         197  Employee_197     Finance   47  117922
197         198  Employee_198   Marketing   40   85766
198         199  Employee_199          IT   24   43403
199         200  Employee_200  Operations   34   62097

[200 rows x 5 columns]

In [63]:
high = df[df['Age']>20]

In [64]:
high

     EmployeeID          Name  Department  Age  Salary
0             1    Employee_1   Marketing   23   91087
1             2    Employee_2       Sales   53   98840
2             3    Employee_3          IT   44   84384
3             4    Employee_4       Sales   43   81005
4             5    Employee_5       Sales   46   76576
..          ...           ...         ...  ...     ...
195         196  Employee_196          IT   31  106429
196         197  Employee_197     Finance   47  117922
197         198  Employee_198   Marketing   40   85766
198         199  Employee_199          IT   24   43403
199         200  Employee_200  Operations   34   62097

[200 rows x 5 columns]

In [71]:
df.loc[(df['Age']==max) & (df['Salary']==max)]

df

     EmployeeID          Name  Department  Age  Salary
0             1    Employee_1   Marketing   23   91087
1             2    Employee_2       Sales   53   98840
2             3    Employee_3          IT   44   84384
3             4    Employee_4       Sales   43   81005
4             5    Employee_5       Sales   46   76576
..          ...           ...         ...  ...     ...
195         196  Employee_196          IT   31  106429
196         197  Employee_197     Finance   47  117922
197         198  Employee_198   Marketing   40   85766
198         199  Employee_199          IT   24   43403
199         200  Employee_200  Operations   34   62097

[200 rows x 5 columns]

In [73]:
df['Age'].max()

np.int64(59)

In [74]:
df['Salary'].max()

np.int64(119912)

In [75]:
df.drop(['high_salary' , ' age'] , axis= 1 )

KeyError: "['high_salary', ' age'] not found in axis"

In [81]:
df = df.rename(columns={'Age':'UMr'})

In [84]:
df

     EmployeeID          Name  Department  UMr  Salary
0             1    Employee_1   Marketing   23  800000
1             2    Employee_2       Sales   53  800000
2             3    Employee_3          IT   44  800000
3             4    Employee_4       Sales   43  800000
4             5    Employee_5       Sales   46  800000
..          ...           ...         ...  ...     ...
195         196  Employee_196          IT   31  800000
196         197  Employee_197     Finance   47  800000
197         198  Employee_198   Marketing   40  800000
198         199  Employee_199          IT   24  800000
199         200  Employee_200  Operations   34  800000

[200 rows x 5 columns]

In [85]:
df.loc[:,['Salary']] = 800000

In [86]:
df

     EmployeeID          Name  Department  UMr  Salary
0             1    Employee_1   Marketing   23  800000
1             2    Employee_2       Sales   53  800000
2             3    Employee_3          IT   44  800000
3             4    Employee_4       Sales   43  800000
4             5    Employee_5       Sales   46  800000
..          ...           ...         ...  ...     ...
195         196  Employee_196          IT   31  800000
196         197  Employee_197     Finance   47  800000
197         198  Employee_198   Marketing   40  800000
198         199  Employee_199          IT   24  800000
199         200  Employee_200  Operations   34  800000

[200 rows x 5 columns]

In [87]:
df.loc[:,['Salary']] = 00000000

In [88]:
df

     EmployeeID          Name  Department  UMr  Salary
0             1    Employee_1   Marketing   23       0
1             2    Employee_2       Sales   53       0
2             3    Employee_3          IT   44       0
3             4    Employee_4       Sales   43       0
4             5    Employee_5       Sales   46       0
..          ...           ...         ...  ...     ...
195         196  Employee_196          IT   31       0
196         197  Employee_197     Finance   47       0
197         198  Employee_198   Marketing   40       0
198         199  Employee_199          IT   24       0
199         200  Employee_200  Operations   34       0

[200 rows x 5 columns]

In [89]:
laddo = pd.read_csv('Heart_disease_statlog.csv')

In [90]:
laddo

,age,Gender,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,70.0,1.0,3,130.0,322,0.0,2,109.0,0,2.4,1,3,1,1
1,67.0,0.0,2,115.0,564,0.0,2,160.0,0,1.6,1,0,3,0
2,57.0,1.0,1,124.0,261,0.0,0,141.0,0,0.3,0,0,3,1
3,64.0,1.0,3,128.0,263,0.0,0,105.0,1,NaN,1,1,3,0
4,74.0,0.0,1,NaN,269,0.0,2,121.0,1,0.2,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
265,52.0,1.0,2,172.0,199,1.0,0,162.0,0,0.5,0,0,3,0
266,44.0,1.0,1,120.0,263,0.0,0,173.0,0,0.0,0,0,3,0
267,56.0,0.0,1,140.0,294,0.0,2,153.0,0,1.3,1,0,1,0
268,57.0,1.0,3,140.0,192,0.0,0,148.0,0,0.4,1,0,2,0
269,67.0,1.0,3,160.0,286,0.0,2,108.0,1,1.5,1,3,1,1

In [91]:
laddo.isnull()

,age,Gender,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,True,False,False,False,False
4,False,False,False,True,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
265,False,False,False,False,False,False,False,False,False,False,False,False,False,False
266,False,False,False,False,False,False,False,False,False,False,False,False,False,False
267,False,False,False,False,False,False,False,False,False,False,False,False,False,False
268,False,False,False,False,False,False,False,False,False,False,False,False,False,False
269,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [92]:
laddo.head(5)

,age,Gender,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,70.0,1.0,3,130.0,322,0.0,2,109.0,0,2.4,1,3,1,1
1,67.0,0.0,2,115.0,564,0.0,2,160.0,0,1.6,1,0,3,0
2,57.0,1.0,1,124.0,261,0.0,0,141.0,0,0.3,0,0,3,1
3,64.0,1.0,3,128.0,263,0.0,0,105.0,1,NaN,1,1,3,0
4,74.0,0.0,1,NaN,269,0.0,2,121.0,1,0.2,0,1,1,0

In [95]:
print(laddo.dropna())

      age  Gender  cp  trestbps  chol  fbs  restecg  thalach  exang  oldpeak  \
0    70.0     1.0   3     130.0   322  0.0        2    109.0      0      2.4
1    67.0     0.0   2     115.0   564  0.0        2    160.0      0      1.6
2    57.0     1.0   1     124.0   261  0.0        0    141.0      0      0.3
6    56.0     1.0   2     130.0   256  1.0        2    142.0      1      0.6
10   59.0     1.0   3     135.0   234  0.0        0    161.0      0      0.5
..    ...     ...  ..       ...   ...  ...      ...      ...    ...      ...
265  52.0     1.0   2     172.0   199  1.0        0    162.0      0      0.5
266  44.0     1.0   1     120.0   263  0.0        0    173.0      0      0.0
267  56.0     0.0   1     140.0   294  0.0        2    153.0      0      1.3
268  57.0     1.0   3     140.0   192  0.0        0    148.0      0      0.4
269  67.0     1.0   3     160.0   286  0.0        2    108.0      1      1.5

     slope  ca  thal  target
0        1   3     1       1
1        1   0     3       0
2        0   0     3       1
6        1   1     2       1
10       1   0     3       0
..     ...  ..   ...     ...
265      0   0     3       0
266      0   0     3       0
267      1   0     1       0
268      1   0     2       0
269      1   3     1       1

[243 rows x 14 columns]

In [96]:
laddo.dropna(how='all')

,age,Gender,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,70.0,1.0,3,130.0,322,0.0,2,109.0,0,2.4,1,3,1,1
1,67.0,0.0,2,115.0,564,0.0,2,160.0,0,1.6,1,0,3,0
2,57.0,1.0,1,124.0,261,0.0,0,141.0,0,0.3,0,0,3,1
3,64.0,1.0,3,128.0,263,0.0,0,105.0,1,NaN,1,1,3,0
4,74.0,0.0,1,NaN,269,0.0,2,121.0,1,0.2,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
265,52.0,1.0,2,172.0,199,1.0,0,162.0,0,0.5,0,0,3,0
266,44.0,1.0,1,120.0,263,0.0,0,173.0,0,0.0,0,0,3,0
267,56.0,0.0,1,140.0,294,0.0,2,153.0,0,1.3,1,0,1,0
268,57.0,1.0,3,140.0,192,0.0,0,148.0,0,0.4,1,0,2,0
269,67.0,1.0,3,160.0,286,0.0,2,108.0,1,1.5,1,3,1,1